In [1]:
%load_ext sql
%sql mysql://root:rootpassword@mysql:3306/mydb

Connecting to 'mysql://root:***@mysql:3306/mydb'

In [2]:
%%sql
CREATE TABLE IF NOT EXISTS `user` (
    id INT NOT NULL AUTO_INCREMENT,
    name VARCHAR(255) NOT NULL,
    PRIMARY KEY (`id`)
);
INSERT INTO `user` (name) VALUES
    ('Alice'),
    ('Bob'),
    ('Charlie');

Running query in 'mysql://root:***@mysql:3306/mydb'

3 rows affected.

++
||
++
++

In [3]:
%sqlcmd tables

+------+
| Name |
+------+
| user |
+------+

In [4]:
%%sql

select * from `user`;

Running query in 'mysql://root:***@mysql:3306/mydb'

6 rows affected.

+----+---------+
| id |   name  |
+----+---------+
| 1  |  Alice  |
| 2  |   Bob   |
| 3  | Charlie |
| 4  |  Alice  |
| 5  |   Bob   |
| 6  | Charlie |
+----+---------+

更多用法见 https://jupysql.ploomber.io/en/latest/integrations/mysql.html